"""
1. Создать произвольный словарь
2. Добавить новый элемент с ключом типа str и значением типа int
3. Добавить новый элемент с ключом типа кортеж(tuple) и значением типа список(list)
4. Получить элемент по ключу
5. Удалить элемент по ключу
6. Получить список ключей словаря"""


def power():
    d = {1: "Испания", 2: "Италия", 3: "Англия", 4: "Франция"}
    d["5"] = "Германия"
    d[(6, 7)] = ["США", "Япония"]
    d.pop(3)
    print(d[(6, 7)])
    k = d.keys()
    print(k)
    print(d)


if __name__ == '__main__':
    power()
